//#include"iostream"
//#include"string"
//using namespace std;
//int main(){
//    char a[10][15] = {
//        {' ','-',' ',   '|',' ','|',  ' ',' ',' ',   '|',' ','|',   ' ','-',' '},      //0
//        {' ',' ',' ',   ' ',' ','|',  ' ',' ',' ',   ' ',' ','|',   ' ',' ',' '},      //1
//        {' ','-',' ',   ' ',' ','|',  ' ','-',' ',   '|',' ',' ',   ' ','-',' '},      //2
//        {' ','-',' ',   ' ',' ','|',  ' ','-',' ',   ' ',' ','|',   ' ','-',' '},      //3
//        {' ',' ',' ',   '|',' ','|',  ' ','-',' ',   ' ',' ','|',   ' ',' ',' '},      //4
//        {' ','-',' ',   '|',' ',' ',  ' ','-',' ',   ' ',' ','|',   ' ','-',' '},      //5
//        {' ','-',' ',   '|',' ',' ',  ' ','-',' ',   '|',' ','|',   ' ','-',' '},      //6
//        {' ','-',' ',   ' ',' ','|',  ' ',' ',' ',   ' ',' ','|',   ' ',' ',' '},      //7
//        {' ','-',' ',   '|',' ','|',  ' ','-',' ',   '|',' ','|',   ' ','-',' '},      //8
//        {' ','-',' ',   '|',' ','|',  ' ','-',' ',   ' ',' ','|',   ' ','-',' '},      //9
//        };
//    int i = 0,j,k = 1;
//    string s = "1075056431";
//    cin>>k>>s;
//    while(i < 15){
//        for(int i1 = 0;i1 < k;i1++){
//            j = 0;
//            while(s[j] != 0){
//                cout<<a[s[j] - 48][i];
//                for(int i1 = 0;i1 < k;i1++){
//                    cout<<a[s[j] - 48][i+1];
//                }
//                cout<<a[s[j] - 48][i+2];
//                cout<<' ';
//                j++;
//            }
//            if(i < 12){
//                cout<<endl;
//            }
//            if(i != 3 && i != 9){
//                break;
//            }
//        }
//        i += 3;
//    }
//}



#include <iostream>
#include <cstdio>
#include <string>
#include <algorithm>
using namespace std;

int k,h,w,r;
char scrn[64][8670];    //先把数字打印到数组里，再输出到屏幕上

bool a[10][7]={                     //每个数字对应的编码
                {1,1,1,1,1,1,0},
                {0,1,1,0,0,0,0},
                {1,1,0,1,1,0,1},
                {1,1,1,1,0,0,1},
                {0,1,1,0,0,1,1},
                {1,0,1,1,0,1,1},
                {1,0,1,1,1,1,1},
                {1,1,1,0,0,0,0},
                {1,1,1,1,1,1,1},
                {1,1,1,1,0,1,1}
            };

void print_scrn(char c){
    if(a[c-'0'][0]) for(int i=r+1;i<r+w-2;i++) scrn[0][i]='-';
    if(a[c-'0'][1]) for(int i=1;i<=k;i++) scrn[i][r+w-2]='|';
    if(a[c-'0'][2]) for(int i=k+2;i<h-1;i++) scrn[i][r+w-2]='|';
    if(a[c-'0'][3]) for(int i=r+1;i<r+w-2;i++) scrn[k+k+2][i]='-';
    if(a[c-'0'][4]) for(int i=k+2;i<h-1;i++) scrn[i][r]='|';
    if(a[c-'0'][5]) for(int i=1;i<=k;i++) scrn[i][r]='|';
    if(a[c-'0'][6]) for(int i=r+1;i<r+w-2;i++) scrn[k+1][i]='-';
}

int main() {
    string s;
    cin>>k>>s;
    h=k*2+3;    //打印到屏幕上字符的高度
    w=k+3;      //每个数字的宽度（包含一个空格）
    for(int i=0;i<s.length();i++){
        print_scrn(s[i]);
        r+=w;
    }
    for(int i=0;i<h;i++){
        for(int j=0;j<r;j++){
            if(scrn[i][j]) putchar(scrn[i][j]);
            else putchar(' ');
        }
        putchar('\n');
    }
    return 0;
}
